In [1]:
import pandas as pd
import numpy as np
import re

In [2]:
df = pd.read_csv("pairs_limpieza.csv", index_col = 0)
df.head(2)

,case_number,year,type,country,area,location,activity,name,age,time,species,injury,fecha_limpia,fatal_limpio,sexo
0,1800.00.00,1800,Unprovoked,seychelles,St. Anne,NaN,a corsair's boat was overturned,NaN,NaN,NaN,NaN,"FATAL, all onboard were killed by sharks",unspecified,Y,F
1,1797.05.28.R,1797,Unprovoked,NaN,NaN,NaN,Dropped overboard,child,NaN,NaN,NaN,FATAL,May,Y,NaN

In [3]:
df.dtypes

case_number     object
year             int64
type            object
country         object
area            object
location        object
activity        object
name            object
age             object
time            object
species         object
injury          object
fecha_limpia    object
fatal_limpio    object
sexo            object
dtype: object

Ejercicio 1

In [4]:
df.head(2)

,case_number,year,type,country,area,location,activity,name,age,time,species,injury,fecha_limpia,fatal_limpio,sexo
0,1800.00.00,1800,Unprovoked,seychelles,St. Anne,NaN,a corsair's boat was overturned,NaN,NaN,NaN,NaN,"FATAL, all onboard were killed by sharks",unspecified,Y,F
1,1797.05.28.R,1797,Unprovoked,NaN,NaN,NaN,Dropped overboard,child,NaN,NaN,NaN,FATAL,May,Y,NaN

In [5]:
df["species"].unique()

array([nan, 'Tiger shark?', 'White sharks', ...,
       "Said to involve a 6 m to 7.3 m [20' to 24'] shark",
       "Said to be a 7.6 m [25'] shark",
       'Thought to involve a porbeagle or mako shark'], dtype=object)

Vamos a clasificar los tiburones en 5 especies: tiburón blanco (White), el tiburón tigre (Tiger ), el tiburón gris (Grey), el tiburón limón (Lemon) y el tiburón toro (Bull) y el resto en 'Unspecified'

Pistas: regex para buscar strings (5 patrones diferentes) y crear función en la que aplicamos el patrón regex

In [6]:
df_copia = df.copy()

In [7]:
species_limpia = []  

def patrones(x): 
    columna_species = df_copia[x]                      
    for fila in columna_species:                      
        if re.match('.*[Ww](hite|HITE).*', str(fila)):
            species_limpia.append('white')
        elif re.match('.*[Tt](iger|IGER).*',str(fila)):
            species_limpia.append('tiger')
        elif re.match('.*[Gg(rey|REY)].*', str(fila)):
            species_limpia.append('grey')
        elif re.match('.*[Ll](emon|EMON).*', str(fila)):
            species_limpia.append('lemon')
        elif re.match('.*[Bb](ull|ULL).*', str(fila)):
            species_limpia.append('bull')
        else:
            species_limpia.append('unspecified')

In [8]:
patrones('species')

Comprobamos que nuestra columna `species` está limpia

In [9]:
df_species_limpia = pd.DataFrame(species_limpia)
df_species_limpia.value_counts()

unspecified    2944
grey           2392
white           666
tiger           282
dtype: int64

In [10]:
df['species'] = df_species_limpia
df.head()

,case_number,year,type,country,area,location,activity,name,age,time,species,injury,fecha_limpia,fatal_limpio,sexo
0,1800.00.00,1800,Unprovoked,seychelles,St. Anne,NaN,a corsair's boat was overturned,NaN,NaN,NaN,unspecified,"FATAL, all onboard were killed by sharks",unspecified,Y,F
1,1797.05.28.R,1797,Unprovoked,NaN,NaN,NaN,Dropped overboard,child,NaN,NaN,unspecified,FATAL,May,Y,NaN
2,1792.09.12,1792,Provoked,england,NaN,On the Thames River,Fishing,male,NaN,NaN,unspecified,"FATAL, PROVOKED INCIDENT",Sep,Y,M
3,1791.00.00,1791,Unprovoked,australia,New South Wales,Port Jackson,NaN,"female, an Australian aboriginal",NaN,NaN,unspecified,"FATAL, ""bitten in two""",unspecified,Y,F
4,1788.05.10,1788,Boat,australia,New South Wales,Sydney Harbor,Fishing,boat,NaN,NaN,unspecified,"No injury to occupants, shark bit oar and rudder",May,N,NaN

Ejercicio 2

In [11]:
df_copia['age'].unique()

array([nan, 'young', '14', '19', '20', '15', '21', '27', '36', '25', '6',
       '16', '50', '13 or 14', '57', '11', '48', '18', '52', '12', '32',
       '10', '34', '30', '60', '33', '29', '54', '41', '37', '56', '69',
       '38', '55', '35', '46', '45', '40s', '28', '24', '26', '49', '22',
       '7', '31', '17', '40', '13', '42', '3', '8', '82', '73', '20s',
       '68', '51', '39', '58', 'Teen', '47', '61', '65', '66', '43',
       '60s', '9', '72', '59', '64', '23', '71', '44', '62', '63', '70',
       '18 months', '53', '30s', '50s', 'teen', '77', '74', '28 & 26',
       '5', '86', '18 or 20', '12 or 13', '46 & 34', '28, 23 & 30',
       'Teens', '36 & 26', '8 or 10', '84', '\xa0 ', ' ', '30 or 36',
       '6½', '21 & ?', '75', '33 or 37', 'mid-30s', '23 & 20', ' 30',
       '7      &    31', ' 28', '20?', "60's", '32 & 30', '16 to 18',
       '87', '67', 'Elderly', 'mid-20s', 'Ca. 33', '74 ', '45 ',
       '21 or 26', '20 ', '>50', '18 to 22', 'adult', '9 & 12', '? & 19',
       '9 months', '25 to 35', '23 & 26', '1', '(adult)', '33 & 37',
       '25 or 28', '37, 67, 35, 27,  ? & 27', '21, 34,24 & 35', '30 & 32',
       '50 & 30', '17 & 35', 'X', '"middle-age"', '13 or 18', '34 & 19',
       '33 & 26', '2 to 3 months', 'MAKE LINE GREEN', ' 43', '81',
       '"young"', '7 or 8', '78', '17 & 16', 'F', 'Both 11', '9 or 10',
       '36 & 23', '  ', 'A.M.', '?    &   14', '10 or 12', '31 or 33',
       '2½'], dtype=object)

In [33]:
# def sacar_edades(col):
#     patron_años = r'\d+'
#     x = re.findall(patron_años, str(col))
#     try:
#         return int(x)
#     except:
#         return np.nan

# sacar_edades(df_copia['age'])

In [15]:
lista_años = []
for i in df_copia['age']:
    try:
        x = int(i)
        lista_años.append(x)
    except:
        np.nan

In [16]:
lista_años

[14,
 19,
 20,
 15,
 21,
 19,
 27,
 36,
 25,
 6,
 16,
 50,
 16,
 15,
 57,
 11,
 48,
 18,
 52,
 15,
 12,
 32,
 10,
 10,
 21,
 34,
 30,
 60,
 32,
 33,
 29,
 54,
 34,
 41,
 37,
 56,
 12,
 19,
 25,
 10,
 69,
 18,
 38,
 55,
 34,
 35,
 46,
 45,
 14,
 18,
 28,
 20,
 54,
 35,
 24,
 25,
 26,
 49,
 25,
 14,
 24,
 25,
 22,
 7,
 31,
 17,
 60,
 15,
 54,
 40,
 31,
 33,
 13,
 28,
 25,
 18,
 35,
 42,
 17,
 37,
 3,
 11,
 69,
 13,
 20,
 34,
 15,
 10,
 12,
 37,
 40,
 8,
 40,
 50,
 46,
 32,
 13,
 16,
 14,
 34,
 82,
 48,
 19,
 30,
 32,
 20,
 73,
 41,
 29,
 33,
 18,
 14,
 33,
 28,
 40,
 17,
 28,
 17,
 68,
 35,
 10,
 21,
 16,
 51,
 39,
 17,
 58,
 30,
 25,
 58,
 26,
 26,
 22,
 37,
 21,
 55,
 57,
 48,
 47,
 20,
 16,
 55,
 61,
 19,
 20,
 65,
 73,
 58,
 41,
 42,
 36,
 36,
 66,
 25,
 29,
 21,
 32,
 17,
 16,
 36,
 43,
 43,
 51,
 50,
 12,
 9,
 22,
 25,
 37,
 20,
 49,
 15,
 21,
 22,
 40,
 72,
 43,
 18,
 29,
 36,
 31,
 9,
 11,
 61,
 10,
 59,
 42,
 34,
 35,
 11,
 59,
 43,
 42,
 19,
 6,
 19,
 27,
 64,
 60,
 23,
 29,
 52,
 13,
 57,
 22,
 11,
 48,
 23,
 59,
 39,
 24,
 15,
 12,
 22,
 26,
 26,
 69,
 60,
 34,
 46,
 22,
 41,
 9,
 19,
 45,
 12,
 41,
 21,
 31,
 65,
 45,
 40,
 41,
 15,
 48,
 11,
 31,
 38,
 71,
 43,
 32,
 58,
 26,
 22,
 55,
 28,
 20,
 9,
 54,
 28,
 19,
 50,
 10,
 42,
 21,
 21,
 35,
 32,
 44,
 9,
 25,
 18,
 22,
 13,
 14,
 22,
 7,
 14,
 27,
 12,
 16,
 20,
 42,
 50,
 29,
 62,
 37,
 54,
 21,
 38,
 15,
 10,
 22,
 10,
 57,
 52,
 47,
 40,
 25,
 35,
 46,
 31,
 40,
 45,
 34,
 38,
 39,
 23,
 32,
 52,
 32,
 68,
 12,
 18,
 19,
 23,
 43,
 19,
 47,
 6,
 37,
 9,
 36,
 10,
 16,
 12,
 13,
 11,
 17,
 47,
 14,
 19,
 19,
 13,
 18,
 30,
 50,
 29,
 65,
 63,
 26,
 71,
 48,
 13,
 70,
 43,
 23,
 36,
 52,
 58,
 9,
 36,
 22,
 41,
 35,
 57,
 20,
 24,
 17,
 38,
 34,
 15,
 12,
 17,
 50,
 17,
 13,
 39,
 44,
 53,
 18,
 34,
 20,
 13,
 7,
 29,
 40,
 15,
 28,
 23,
 36,
 50,
 43,
 52,
 16,
 13,
 17,
 33,
 29,
 31,
 26,
 10,
 7,
 10,
 45,
 20,
 51,
 8,
 61,
 39,
 63,
 14,
 19,
 48,
 42,
 15,
 43,
 16,
 39,
 43,
 14,
 22,
 37,
 29,
 10,
 38,
 35,
 44,
 12,
 40,
 23,
 42,
 25,
 63,
 38,
 66,
 9,
 42,
 42,
 10,
 21,
 21,
 21,
 28,
 28,
 24,
 31,
 37,
 19,
 35,
 29,
 30,
 26,
 57,
 19,
 58,
 35,
 25,
 77,
 16,
 46,
 60,
 24,
 41,
 45,
 25,
 6,
 74,
 55,
 45,
 50,
 27,
 7,
 45,
 21,
 13,
 43,
 25,
 17,
 3,
 9,
 47,
 50,
 11,
 16,
 20,
 19,
 10,
 17,
 56,
 32,
 40,
 18,
 64,
 50,
 18,
 50,
 15,
 33,
 63,
 48,
 29,
 20,
 14,
 28,
 15,
 10,
 58,
 32,
 11,
 41,
 30,
 29,
 42,
 36,
 16,
 34,
 51,
 9,
 21,
 40,
 53,
 50,
 24,
 58,
 47,
 34,
 50,
 30,
 68,
 28,
 39,
 46,
 16,
 48,
 18,
 62,
 43,
 26,
 23,
 29,
 20,
 32,
 60,
 31,
 25,
 61,
 20,
 32,
 14,
 30,
 43,
 25,
 51,
 39,
 35,
 24,
 55,
 38,
 42,
 11,
 21,
 22,
 52,
 29,
 19,
 25,
 37,
 32,
 8,
 56,
 53,
 34,
 18,
 31,
 56,
 39,
 17,
 48,
 44,
 50,
 12,
 22,
 24,
 23,
 24,
 43,
 42,
 52,
 29,
 60,
 6,
 26,
 16,
 12,
 62,
 16,
 6,
 23,
 18,
 16,
 42,
 57,
 30,
 12,
 25,
 33,
 46,
 22,
 20,
 30,
 47,
 15,
 28,
 20,
 27,
 28,
 33,
 21,
 20,
 61,
 15,
 17,
 34,
 31,
 19,
 42,
 29,
 26,
 24,
 44,
 25,
 53,
 28,
 34,
 23,
 27,
 35,
 51,
 14,
 63,
 18,
 10,
 35,
 42,
 27,
 26,
 32,
 41,
 50,
 64,
 51,
 29,
 27,
 48,
 43,
 21,
 5,
 38,
 17,
 25,
 37,
 30,
 21,
 19,
 19,
 48,
 39,
 21,
 10,
 49,
 16,
 12,
 25,
 32,
 27,
 30,
 7,
 54,
 36,
 14,
 43,
 29,
 6,
 54,
 12,
 14,
 16,
 17,
 28,
 21,
 22,
 10,
 20,
 35,
 15,
 31,
 28,
 24,
 28,
 19,
 22,
 33,
 28,
 86,
 15,
 37,
 43,
 37,
 32,
 17,
 49,
 41,
 27,
 48,
 46,
 30,
 24,
 36,
 21,
 32,
 49,
 58,
 37,
 38,
 25,
 55,
 7,
 16,
 37,
 16,
 46,
 70,
 54,
 46,
 70,
 48,
 47,
 33,
 21,
 20,
 30,
 14,
 19,
 22,
 29,
 18,
 29,
 15,
 27,
 24,
 24,
 24,
 34,
 43,
 10,
 31,
 45,
 16,
 47,
 25,
 35,
 37,
 16,
 20,
 10,
 13,
 55,
 9,
 21,
 20,
 19,
 48,
 20,
 6,
 13,
 17,
 18,
 40,
 20,
 49,
 58,
 60,
 59,
 10,
 29,
 68,
 35,
 24,
 34,
 19,
 60,
 46,
 18,
 31,
 38,
 14,
 29,
 54,
 37,
 9,
 32,
 20,
 55,
 27,
 18,
 22,
 24,
 39,
 58,
 49,
 10,
 31,
 22,
 27,
 18,
 25,
 21,
 27,
 17,
 54,
 10,
 23,
 23,
 39,
 34,
 60,
 15,
 25,
 22,
 26,
 56,
 14,
 14,
 41,
 14,
 11,
 26,
 19,
 57,
 37,
 12,
 43,
 52,
 26,
 14,
 50,
 46,
 31,
 49,
 55,
 27,
 48,
 20,
 23,
 52,
 31,
 49,
 40,
 24,
 15,
 59,
 16,
 17,
 17,
 61,
 21,
 19,
 40,
 15,
 33,
 31,
 41,
 49,
 17,
 15,
 19,
 25,
 17,
 24,
 13,
 31,
 22,
 49,
 10,
 29,
 51,
 15,
 45,
 39,
 34,
 24,
 50,
 15,
 11,
 43,
 44,
 40,
 43,
 32,
 40,
 51,
 43,
 15,
 52,
 29,
 27,
 52,
 19,
 26,
 20,
 20,
 47,
 7,
 38,
 13,
 31,
 33,
 17,
 44,
 9,
 8,
 15,
 16,
 52,
 24,
 14,
 17,
 16,
 53,
 42,
 46,
 29,
 37,
 40,
 35,
 14,
 40,
 15,
 14,
 9,
 49,
 21,
 28,
 37,
 40,
 6,
 24,
 24,
 18,
 24,
 32,
 21,
 66,
 14,
 32,
 19,
 30,
 15,
 16,
 18,
 39,
 52,
 13,
 14,
 8,
 27,
 49,
 26,
 25,
 14,
 42,
 20,
 20,
 26,
 24,
 53,
 31,
 34,
 52,
 28,
 32,
 14,
 21,
 42,
 37,
 32,
 52,
 31,
 22,
 16,
 23,
 48,
 23,
 56,
 14,
 58,
 36,
 15,
 12,
 58,
 15,
 24,
 54,
 27,
 52,
 16,
 7,
 20,
 15,
 19,
 30,
 9,
 19,
 51,
 20,
 36,
 15,
 14,
 48,
 ...]

In [17]:
df_años = pd.DataFrame(lista_años)
df_años.head()

    0
0  14
1  19
2  20
3  15
4  21

In [18]:
df_años.dtypes

0    int64
dtype: object

In [19]:
df['age'] = df_años.astype('int64')

In [20]:
df.head()

,case_number,year,type,country,area,location,activity,name,age,time,species,injury,fecha_limpia,fatal_limpio,sexo
0,1800.00.00,1800,Unprovoked,seychelles,St. Anne,NaN,a corsair's boat was overturned,NaN,14.0,NaN,unspecified,"FATAL, all onboard were killed by sharks",unspecified,Y,F
1,1797.05.28.R,1797,Unprovoked,NaN,NaN,NaN,Dropped overboard,child,19.0,NaN,unspecified,FATAL,May,Y,NaN
2,1792.09.12,1792,Provoked,england,NaN,On the Thames River,Fishing,male,20.0,NaN,unspecified,"FATAL, PROVOKED INCIDENT",Sep,Y,M
3,1791.00.00,1791,Unprovoked,australia,New South Wales,Port Jackson,NaN,"female, an Australian aboriginal",15.0,NaN,unspecified,"FATAL, ""bitten in two""",unspecified,Y,F
4,1788.05.10,1788,Boat,australia,New South Wales,Sydney Harbor,Fishing,boat,21.0,NaN,unspecified,"No injury to occupants, shark bit oar and rudder",May,N,NaN

In [21]:
df['age'].dtypes

dtype('float64')

NO tiene ningun sentido

Para que no aparezca el Type Error tenemos que ejecutar el siguiente codigo:

In [ ]:
df_copia['age'] = df_copia['age'].astype(str)

# Prueba

In [69]:
col_age = df_copia.copy()
col_age["age"]

0       nan
1       nan
2       nan
3       nan
4       nan
       ...
6279    nan
6280    nan
6281    nan
6282    nan
6283    nan
Name: age, Length: 6284, dtype: object

In [87]:
# me he puesto un ejemplo para ayudarme a sacar la función
# df_copia[df_copia['age'] == '"middle-age"'].index
# df_copia['age'][4222] = 50
def limpiar_valores_str_unicos(col):
    lista_valores = ['young', 'Teen', '18 months', '30s', '50s', 'teen', 'Teens', "60's", 'adult', '(adult)', '"middle-age"', '2 to 3 months', '"young"','2½','40s','20s', '60s','18 or 20', '12 or 13','8 or 10',  '30 or 36','6½','33 or 37', 'mid-30s', '20?', '16 to 18','Elderly','mid-20s','Ca. 33','21 or 26','>50','18 to 22','25 to 35','25 or 28','13 or 18','7 or 8','9 or 10','10 or 12','31 or 33', '13 or 14']
    lista_valores_nuevo = [21, 21, 1.5, 42.5, 54, 21, 21, 65, 42.5, 42.5, 42.5, 0.3, 21, 2.5, 45, 25, 60, 19, 12.5, 9,33, 6.5, 35, 35,20, 17, 65, 25,33,23.5,55,20,0.75, 30,26.5, 15.5,7.5,9.5, 11, 32, 13.5  ]
    for valor in lista_valores:
        index = col_age[col == valor].index
        for valor_nuevo in lista_valores_nuevo:
           col[index] = valor_nuevo 
limpiar_valores_str_unicos(col_age['age'])

/tmp/ipykernel_276/306085208.py:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  col[index] = valor_nuevo

En nuestra columna `age` existen dos tipos de datos: los strings que son una estimación de un número como por ejemplo `18 or 20` y los que se refieren a varios registros de un mismo dato `'21, 34,24 & 35'`

Aquí hemos limpiado los strings que  se refieren a un **único** dato. En este caso lo hemos hecho manualmente ya que no existe un patrón fácil y hay que tomar la decisión de con qué  número reemplazar uno a uno. 

Para ello hemos supuesto estos rangos de edad: de 0 12 años: child, 13 a 29 young adult, 30 a 55 adult, +55 senior. Si el string hacia referencia a una etapa, como `teen` o `ederly`, hemos supuesto la media de esa etapa para el rango establecido. Ejemplo: `teen` para nosotras es `young adult` así que lo hemos reemplazado por la media de edad de este rango `(13+29)/2 = 21`

Si hubiese dos valores `18 or 20` hemos reemplazado el string por la media de los valores.

In [89]:
col_age['age'].unique()

array(['nan', 32, '14', '19', '20', '15', '21', '27', '36', '25', '6',
       '16', '50', 13.5, '57', '11', '48', '18', '52', '12', '32', '10',
       '34', '30', '60', '33', '29', '54', '41', '37', '56', '69', '38',
       '55', '35', '46', '45', '28', '24', '26', '49', '22', '7', '31',
       '17', '40', '13', '42', '3', '8', '82', '73', '68', '51', '39',
       '58', '47', '61', '65', '66', '43', '9', '72', '59', '64', '23',
       '71', '44', '62', '63', '70', '53', '77', '74', '28 & 26', '5',
       '86', '46 & 34', '28, 23 & 30', '36 & 26', '84', '\xa0 ', ' ',
       '21 & ?', '75', '23 & 20', ' 30', '7      &    31', ' 28',
       '32 & 30', '87', '67', '74 ', '45 ', '20 ', '9 & 12', '? & 19',
       '9 months', '23 & 26', '1', '33 & 37', '37, 67, 35, 27,  ? & 27',
       '21, 34,24 & 35', '30 & 32', '50 & 30', '17 & 35', 'X', 50,
       '34 & 19', '33 & 26', 'MAKE LINE GREEN', ' 43', '81', '78',
       '17 & 16', 'F', 'Both 11', '36 & 23', '  ', 'A.M.', '?    &   14'],
      dtype=object)

# Final prueba

In [ ]:
# patron_años = r'\d+'
# x = re.findall(patron_años, df_copia['age'])

In [ ]:
# def sacar_edades(col):
#     patron_años = r'\d+'
#     x = re.match(patron_años, col)
#     try:
#         return x
#     except:
#         return np.nan

# sacar_edades(df_copia['age'])

In [90]:
#col_age['age'] = col_age['age'].astype(str)

In [52]:
#df_copia['age'] = df_copia['age'].astype(str)

In [ ]:
# def sacar_edades(col):
#     patron_años = r'\d+'
#     x = re.findall(patron_años, col)
#     try:
#         return x
#     except:
#         return np.nan

# sacar_edades(col_age['age'])

Aplicamos la función

In [53]:
#df_copia['age_new'] = df_copia['age'].apply(sacar_edades)

In [ ]:
#df_copia['age'].unique()

In [ ]:
#df_copia['age_new'].unique()

In [ ]:
#df_copia.head(30)

In [ ]:
#df["age_new"].unique()

In [ ]:
# df = df.explode('age_new')
# df["age_new"].sample(10)

Falta comprobar que ha funcionado

In [12]:
df.head()

,case_number,year,type,country,area,location,activity,name,age,time,species,injury,fecha_limpia,fatal_limpio,sexo
0,1800.00.00,1800,Unprovoked,seychelles,St. Anne,NaN,a corsair's boat was overturned,NaN,NaN,NaN,unspecified,"FATAL, all onboard were killed by sharks",unspecified,Y,F
1,1797.05.28.R,1797,Unprovoked,NaN,NaN,NaN,Dropped overboard,child,NaN,NaN,unspecified,FATAL,May,Y,NaN
2,1792.09.12,1792,Provoked,england,NaN,On the Thames River,Fishing,male,NaN,NaN,unspecified,"FATAL, PROVOKED INCIDENT",Sep,Y,M
3,1791.00.00,1791,Unprovoked,australia,New South Wales,Port Jackson,NaN,"female, an Australian aboriginal",NaN,NaN,unspecified,"FATAL, ""bitten in two""",unspecified,Y,F
4,1788.05.10,1788,Boat,australia,New South Wales,Sydney Harbor,Fishing,boat,NaN,NaN,unspecified,"No injury to occupants, shark bit oar and rudder",May,N,NaN

In [96]:
df.to_csv("pairs_limpieza.csv")